<!DOCTYPE html>
<html lang="hu">

<head>
    <meta charset="UTF-8">
    <meta name="author" content="slapec">
    <meta name="keywords" content="">
    <meta name="generator" content="slage 1.0.0">
    <title>slapec</title>
    <link rel="stylesheet" href="/src/static/style.css">
    <link rel="stylesheet" href="//cdn.jsdelivr.net/gh/highlightjs/cdn-release@9.17.1/build/styles/default.min.css">

    
<link rel="stylesheet" href="/src/static/index.css">

</head>
<body>
    <header class="site">
        <h1><a href="/">slapec</a></h1>
        <h2>ha már innen is költöznöm kell, akkor baj van</h2>
    </header>

    <main class="site">
        
    <ol>
        
        <li>
            <article class="post">
    <header>
        <h1>
            <a href="/posts/2020/szilveszter_margojara.html">Szilveszter marg&#243;j&#225;ra</a></h1>
        <h2>2020-01-01 10:14:47</h2>
    </header>
    
<p>
    Ha szilveszter, akkor durrogtat&#225;s, &#233;s ha durrogtat&#225;s, akkor k&#243;bor kuty&#225;k, &#233;s ha
    k&#243;bor kuty&#225;k, akkor minden ember dugja fel mag&#225;nak a pet&#225;rd&#225;j&#225;t, nem?
</p>
<p>
    &#201;n szerintem ez egy t&#246;bbdimenzi&#243;s probl&#233;ma. Mondjuk szem&#233;lyesen nem &#233;lvezem a pet&#225;rd&#225;z&#225;st,
    viszont a t&#369;zij&#225;t&#233;kot igen. T&#246;bbek k&#246;zt ez&#233;rt is j&#225;rok a Defqon.1-ra, de ez most m&#225;s t&#233;ma.
    <br>
    Nem lenne rossz, ha annyi &#233;rz&#233;kenys&#233;g lenne az emberekben, hogy t&#233;nyleg, csak 18 &#243;ra ut&#225;n kezdik a rak&#233;t&#225;z&#225;st ...
    <br>
    neg az se lenne rossz, ha az &#233;vben egyetlen kibaszott napon t&#246;r&#337;dn&#233;l a bl&#246;kivel, &#233;s ha kell, beviszed a lak&#225;sba,
    hogy ne szaladjon el. Igen, tudom, ott se lesz nyugta, &#233;s hallottam, hogy a kuty&#225;knak ez olyan, mint a h&#225;bor&#250;,
    meg egy&#233;bk&#233;nt te magad is ut&#225;lod a t&#369;zij&#225;t&#233;kot, s&#337;t, legsz&#237;vesebben bevezetn&#233;d az "egy kutya vagyok" opci&#243;t a gender
    tanulm&#225;nyokba. Ok&#233;.
    <br>
    Biztos &#233;n vagyok az &#246;nz&#337; fasz, meg lehet az is baj, hogy macsk&#225;s vagyok, de sz&#225;momra a v&#225;ros az emberek vil&#225;ga,
    ez&#233;rt nem &#233;rzem azt, hogy bocs&#225;natot k&#233;ne k&#233;rnem egyetlen egy nap&#233;rt.
</p>
<p>
    Nem veszek t&#369;zij&#225;t&#233;kot, sajn&#225;lom r&#225; a p&#233;nzt. De ha venn&#233;k, &#233;s haszn&#225;ln&#225;m, az el&#337;&#237;rt id&#337;s&#225;vban tenn&#233;m.
</p>
<p>
    Nincs kuty&#225;m, se macsk&#225;m, mert szerintem az hihetetlen&#252;l &#246;nz&#337;, hogy a saj&#225;t j&#243;kedvem miatt beer&#337;ltetek egy &#225;llatot
    a 48m^2-be a panelba. De ha lenne, vigy&#225;zn&#233;k r&#225; a kurva &#233;letbe.
</p>

    <footer class="post">
        
            -slapec
        
    </footer>
</article>

    
        </li>
        
        <li>
            <article class="post">
    <header>
        <h1>
            <a href="/posts/2020/7_perccel_ejfel_utan.html">7 perccel &#233;jf&#233;l ut&#225;n</a></h1>
        <h2>2020-01-01 10:03:18</h2>
    </header>
    
<p>
    Mondjuk azt, hogy ez az els&#337;, norm&#225;lisan megfogalmazott(nak sz&#225;nt) bejegyz&#233;sem.
</p>
<p>
    Alig m&#250;lt el 7 perccel &#233;jf&#233;l, 2020 van. Azt mes&#233;ltem m&#225;r, hogy ilyenkor, szilveszterkor k&#233;t hull&#225;mban indulnak
    a szilveszteri rak&#233;t&#225;k? Az els&#337; term&#233;szetesen pontban &#233;jf&#233;lkor. Ut&#225;na viszont, &#250;gy nagyj&#225;b&#243;l 7 perccel k&#233;s&#337;bb,
    indul az igazi show; ki is tart m&#233;g vagy negyed &#243;r&#225;ig.
</p>
<p>
    L&#233;nyeg a l&#233;nyeg, hogy &#250;gy &#225;llap&#237;tottam meg, az &#233;jf&#233;li koccint&#225;s &#233;s &#246;lelkez&#233;s &#225;tlag 7 percig tart.
</p>
<p>
    Na, akkor BU&#201;K mindenkinek ;)
</p>

    <footer class="post">
        
            -slapec
        
    </footer>
</article>

    
        </li>
        
        <li>
            <article class="post">
    <header>
        <h1>
            <a href="/posts/2019/masodik.html">M&#225;sodik</a></h1>
        <h2>2019-12-27 14:14:28</h2>
    </header>
    
<p>
    Most m&#225;r csak az&#233;rt is kell &#237;rnom p&#225;r bejegyz&#233;st, hogy tesztelhessem a blog engine-emet.
</p>
<p>
    Az egyik legfontosabb feature, hogy m&#369;k&#246;dik-e a syntax highlighting:
</p>
<pre>
    <code class="python">
        def hello_world():
            return
    </code>
</pre>
<p>
    A lapoz&#225;s m&#233;g egyel&#337;re nem m&#369;k&#246;dik, de amennyi postot szoktam &#237;rni, szerintem egy
    &#250;jabb &#233;vtizedig fog tartani, mire sz&#252;ks&#233;g lesz erre a feature-re.
</p>

    <footer class="post">
        
            -slapec
        
    </footer>
</article>

    
        </li>
        
        <li>
            <article class="post">
    <header>
        <h1>
            <a href="/posts/2019/elso.html">Els&#337;!</a></h1>
        <h2>2019-12-27 13:44:18</h2>
    </header>
    
<p>
    Ezerszer megpr&#243;b&#225;ltam m&#225;r, m&#233;gis mindig abbamaradt
</p>
<p>
    Most se &#237;g&#233;rem meg, hogy &#246;r&#246;kk&#233;, rendszeresen fogom vezetni ezt a kis blogot,
    de v&#233;gre &#237;rtam egy kis gener&#225;tort, amivel rem&#233;lhet&#337;leg most m&#225;r k&#233;nyelmesen,
    csak az &#237;r&#225;sra f&#243;kusz&#225;lva blogolhatok.
</p>

    <footer class="post">
        
            -slapec
        
    </footer>
</article>

    
        </li>
        
    </ol>

    </main>

    

    <footer class="site">
        <a href="https://github.com/slapec/slage">♡ slage 1.0.0</a>
    </footer>

    <script src="//cdn.jsdelivr.net/gh/highlightjs/cdn-release@9.17.1/build/highlight.min.js"></script>
    <script>hljs.initHighlightingOnLoad();</script>
</body>
</html>